/* ============================================================
 *  金字塔.c —— Day 3 循环练习
 *
 *  目标输出（n=5 时）:
 *          *
 *         ***
 *        *****
 *       *******
 *      *********
 *
 *  观察提示:
 *    - 一共 n 行
 *    - 星号数是奇数: 1, 3, 5, 7, 9 ...
 *    - 前导空格一行比一行少 1
 * ============================================================ */

#include <stdio.h>

int main(void)
{
    int n ;
    printf("输入你想要的金字塔层数\n");
    scanf("%d",&n);
         /* 想打几行的金字塔, 改这里 */
for (int i = 1; i <= n; i++)
{
    for (int k = n - 1; k >= i; k--)
    {
        printf(" ");/* code */
    }
    
   for (int j = 0; j < (i*2)-1; j++)
   {
    printf("*");/* code */
   }
   printf("\n"); /* code */
}

    /* TODO: 用两层 for 循环把上面的图打出来 */

    return 0;
}